In [40]:
import numpy as np
import pandas as pd

In [41]:
a1=np.linspace(10,15,5,dtype="int")
a2=np.linspace(15,20,5,dtype="int")
a3=np.linspace(20,25,5,dtype="int")
df=pd.DataFrame([a1,a2,a3])
df

    0   1   2   3   4
0  10  11  12  13  15
1  15  16  17  18  20
2  20  21  22  23  25

In [42]:
sözlük={"var1":a1,"var2":a2,"var3":a3} #hocam dikkat edelim sözlük atadığımızda key değerleri column olur :)
df2=pd.DataFrame(sözlük)
df2

   var1  var2  var3
0    10    15    20
1    11    16    21
2    12    17    22
3    13    18    23
4    15    20    25

In [43]:
type(df)

pandas.core.frame.DataFrame

In [44]:
type(df2)

pandas.core.frame.DataFrame

In [29]:
df[0:2]

    0   1   2   3   4
0  10  11  12  13  15
1  15  16  17  18  20

In [45]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [46]:
df2.index=["a","b","c","d","e"]

In [18]:
df2

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [19]:
df2["a":"d"]

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23

In [26]:
df2.at["c","var3"] #:))

22

## silme

In [12]:
df2.drop("a",axis=0)

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [13]:
df2 #kalıcı olması için inplace aktif olmalı

   var1  var2  var3
a    10    15    20
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [14]:
df2.drop("a",axis=0,inplace=True)
df2

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [15]:
df2

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

fancy index ile silme

In [22]:
delete=["c","e"]
df2.drop(delete,axis=0)

   var1  var2  var3
b    11    16    21
d    13    18    23

### sorgulama in

In [23]:
l=["var1","var2","var"]
for i in l:
    print(i in df2)

True
True
False

In [47]:
df

    0   1   2   3   4
0  10  11  12  13  15
1  15  16  17  18  20
2  20  21  22  23  25

In [25]:
delet=[1,2,3]
df.drop(delet,axis=1)

    0   4
0  10  15
1  15  20
2  20  25

## for accessing one single element at. and iat functions

In [48]:
datf=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8],"C":[9,-1,-2,-3]},index=["x","y","z","t"])
datf

   A  B  C
x  1  5  9
y  2  6 -1
z  3  7 -2
t  4  8 -3

In [32]:
datf.at["y","C"] #at. foksiyonunda isteğimi değerin row ve column ismi(key)ni gireriz

-1

In [34]:
datf.iat[2,1] #iat. fonksiyonunda ise row ve cloumn isimlerini bilmene gerek klasik numaralandırmaya göre çağirabilirsin :))

7

### yeni sutun yada satir ekleme

In [38]:
datf["D"]=datf["A"]*2
datf["D"]

x    2
y    4
z    6
t    8
Name: D, dtype: int64

In [49]:
datf

   A  B  C
x  1  5  9
y  2  6 -1
z  3  7 -2
t  4  8 -3

## appand()
sözlül larak row ekleme

In [93]:
df=pd.DataFrame({"A":[6,5,4],"B":[1,2,2],"C":[3,3,3]})
df
datf.append(df)

/var/folders/09/145085653lg5n_gp0jh5fh240000gn/T/ipykernel_915/1891410352.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  datf.append(df)

   A  B  C
x  1  5  9
y  2  6 -1
z  3  7 -2
t  4  8 -3
0  6  1  3
1  5  2  3
2  4  2  3

In [86]:
nw=np.array([6,5,4]).reshape(1,3)
nw=pd.DataFrame(nw)
datf.append(nw)

/var/folders/09/145085653lg5n_gp0jh5fh240000gn/T/ipykernel_915/1649513243.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  datf.append(nw)

     A    B    C    0    1    2
x  1.0  5.0  9.0  NaN  NaN  NaN
y  2.0  6.0 -1.0  NaN  NaN  NaN
z  3.0  7.0 -2.0  NaN  NaN  NaN
t  4.0  8.0 -3.0  NaN  NaN  NaN
0  NaN  NaN  NaN  6.0  5.0  4.0

In [56]:
datf.append(datfNew)

/var/folders/09/145085653lg5n_gp0jh5fh240000gn/T/ipykernel_915/2196095757.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  datf.append(datfNew)

     A    B    C     D
x  1.0  5.0  9.0   NaN
y  2.0  6.0 -1.0   NaN
z  3.0  7.0 -2.0   NaN
t  4.0  8.0 -3.0   NaN
0  NaN  NaN  NaN   6.0
1  NaN  NaN  NaN  79.0
2  NaN  NaN  NaN   6.0